Overload List
Name  |   Description
GetValidTypes
 Obtains a set of types that are valid for this element.
GetValidTypes(Document, ICollection ElementId )
 Obtains a set of types that are valid for all given elements.
 See Also
  Element Class
  Element Members
  Autodesk.Revit.DB Namespace